Revit 2027 API
DirectContext3DHandleSettings(Boolean, Int32) Constructor
 Constructs an instance of settings with provided values.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectContext3DHandleSettings(
	bool visibility,
	int transparency
)
Public Sub New (
	visibility As Boolean,
	transparency As Integer
)
public:
DirectContext3DHandleSettings(
	bool visibility,
	int transparency
)
new :
        visibility : bool *
        transparency : int -> DirectContext3DHandleSettings
Parameters
visibility Boolean
 Source visibility.
transparency Int32
 Source transparency.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The value is invalid. The valid range is 0 through 100
See Also
Reference
DirectContext3DHandleSettings Class
DirectContext3DHandleSettings Overload
Autodesk.Revit.DB.DirectContext3D Namespace